rnavarro/openevse_esp32_firmware/src/net_manager.cpp
#include "emonesp.h"
#include "net_manager.h"
#include "app_config.h"
#include "lwip/netif.h"
#include "esp_netif_net_stack.h"
#include "mdns.h"
#include "lcd.h"
#include "espal.h"
#include "time_man.h"
#include "event.h"

#include "LedManagerTask.h"

#ifdef ESP32
#include <WiFi.h>
#include <esp_wifi.h>
#include <esp_netif.h>
#include <ESPmDNS.h>              // Resolve URL for update server etc.
#elif defined(ESP8266)
#include <ESP8266WiFi.h>
#include <ESP8266mDNS.h>              // Resolve URL for update server etc.
#else
#error Platform not supported
#endif

#include <MongooseCore.h>

#include <DNSServer.h>                // Required for captive portal

#ifdef ENABLE_WIRED_ETHERNET
#include <ETH.h>
#endif

#ifdef ESP32
#include "wifi_esp32.h"
#endif

#ifndef WIRED_CONNECT_TIMEOUT
#define WIRED_CONNECT_TIMEOUT (15 * 1000)
#endif

#ifndef ACCESS_POINT_AUTO_STOP_TIMEOUT
#define ACCESS_POINT_AUTO_STOP_TIMEOUT (10 * 1000)
#endif

NetManagerTask *NetManagerTask::_instance = NULL;

NetManagerTask::NetManagerTask(LcdTask &lcd, LedManagerTask &led, TimeManager &time) :
  _dnsServerStarted(false),
  _dnsPort(53),
  _softAP_ssid("OpenEVSE"),
  _softAP_password("openevse"),
  _apIP(192, 168, 4, 1),
  _apNetMask(255, 255, 255, 0),
  _apClients(0),
  _state(NetState::Starting),
  _ipaddress(""),
  _macaddress(""),
  _clientDisconnects(0),
  _clientRetry(false),
  _clientRetryTime(0),
  _wifiButtonState(!WIFI_BUTTON_PRESSED_STATE),
  _wifiButtonTimeOut(millis()),
  _apMessage(false),
  #ifdef ENABLE_WIRED_ETHERNET
  _ethConnected(false),
  #endif
  _lcd(lcd),
  _led(led),
  _time(time)
{
}

void NetManagerTask::begin()
{
  if(NULL == _instance)
  {
    _instance = this;
    MicroTask.startTask(this);
  }
}

// -------------------------------------------------------------------
// Start Access Point
// Access point is used for wifi network selection
// -------------------------------------------------------------------
void NetManagerTask::wifiStartAccessPoint()
{
  DBUGLN("Starting AP");

  DBUGVAR(isWifiModeAp());
  DBUGVAR(isWifiModeSta());

  if((esid == 0 || esid == "") && isWifiModeSta()) {
    WiFi.disconnect(true);
  }

  WiFi.enableAP(true);
  WiFi.enableSTA(true); // Needed for scanning
  WiFi.softAPConfig(_apIP, _apIP, _apNetMask);
  // set country code to "world safe mode"
  esp_wifi_set_country_code("01", true);

  String softAP_ssid;

  if (ap_ssid.length() < 2) {
     // Create Unique SSID e.g "OpenEVSE_XXXXXX"
    softAP_ssid = String(_softAP_ssid) + "_" + ESPAL.getShortId();
  }
  else {
    softAP_ssid = ap_ssid;
  }

  // Use the existing channel if set
  int channel = WiFi.channel();
  DBUGVAR(channel);
  if(0 == channel || esid == 0 || esid == "") {
    // Pick a random channel out of 1, 6 or 11
    channel = (random(3) * 5) + 1;
  }
  DBUGVAR(channel);
  WiFi.softAP(softAP_ssid.c_str(), ap_pass.length()>=8?ap_pass.c_str():_softAP_password, channel);

  // Setup the DNS server redirecting all the domains to the apIP
  _dnsServer.setErrorReplyCode(DNSReplyCode::NoError);
  _dnsServerStarted = _dnsServer.start(_dnsPort, "*", _apIP);

  IPAddress myIP = WiFi.softAPIP();

  char tmpStr[40];
  sprintf(tmpStr, "%d.%d.%d.%d", myIP[0], myIP[1], myIP[2], myIP[3]);
  _ipaddress = tmpStr;
  _macaddress = WiFi.macAddress();

  DEBUG.printf("AP IP Address: %s\r\n", tmpStr);
  DEBUG.printf("Channel: %d\r\n", WiFi.channel());

  _lcd.display(softAP_ssid, 0, 0, 0, LCD_CLEAR_LINE);
  _lcd.display(String(F("Pass: ")) + _softAP_password, 0, 1, 15 * 1000, LCD_CLEAR_LINE);

  _led.setWifiMode(false, false);
  _lcd.setWifiMode(false, false);
  _apClients = 0;
  _state = NetState::AccessPointConnecting;
}

void NetManagerTask::wifiStopAccessPoint()
{
  WiFi.softAPdisconnect(true);
  _dnsServer.stop();
  _dnsServerStarted = false;
}

// -------------------------------------------------------------------
// Start Client, attempt to connect to Wifi network
// -------------------------------------------------------------------
void NetManagerTask::wifiStartClient()
{
  wifiClientConnect();

  _led.setWifiMode(true, false);
  _lcd.setWifiMode(true, false);
  _state = NetState::StationClientConnecting;
}

void NetManagerTask::wifiClientConnect()
{
  DEBUG.print("Connecting to SSID: ");
  DEBUG.println(esid.c_str());
  // DEBUG.print(" epass:");
  // DEBUG.println(epass.c_str());

  WiFi.hostname(esp_hostname.c_str());
  WiFi.setSleep(WIFI_PS_NONE);
  WiFi.setScanMethod(WIFI_ALL_CHANNEL_SCAN);
  WiFi.setSortMethod(WIFI_CONNECT_AP_BY_SIGNAL);
  WiFi.begin(esid.c_str(), epass.c_str());
  // Request IPv6 on STA interface (v2.x API, uppercase V). May legitimately
  // fail here if the netif isn't up yet — the STA_CONNECTED handler retries.
  // Logged to diagnose cold-boot races where IPv6 never initializes.
  bool ipv6_ok = WiFi.enableIpV6();
  DEBUG.printf("WiFi enableIpV6 (post-begin): %s\r\n", ipv6_ok ? "OK" : "FAILED");

  _clientRetryTime = millis() + WIFI_CLIENT_RETRY_TIMEOUT;
}

void NetManagerTask::wifiScanNetworks(WiFiScanCompleteCallback callback)
{
  if(WiFi.scanComplete() != WIFI_SCAN_RUNNING) {
    WiFi.scanNetworks(true, false, false);
  }
  _scanCompleteCallbacks.push_back(callback);
}

void NetManagerTask::displayState()
{
  _lcd.display(F("Hostname:"), 0, 0, 0, LCD_CLEAR_LINE);
  _lcd.display(esp_hostname.c_str(), 0, 1, 5000, LCD_CLEAR_LINE);

  _lcd.display(F("IP Address:"), 0, 0, 0, LCD_CLEAR_LINE);
  _lcd.display(_ipaddress.c_str(), 0, 1, 5000, LCD_CLEAR_LINE);
}

void NetManagerTask::haveNetworkConnection(IPAddress myAddress)
{
  char tmpStr[40];
  sprintf(tmpStr, "%d.%d.%d.%d", myAddress[0], myAddress[1], myAddress[2], myAddress[3]);
  _ipaddress = tmpStr;
  _macaddress = WiFi.macAddress();

  DEBUG.printf("Connected, IP: %s\r\n", tmpStr);

  if (getIpv6Global().length() > 0) {
    DEBUG.printf("Connected, IPv6 global: %s\r\n", getIpv6Global().c_str());
  }
  if (getIpv6LinkLocal().length() > 0) {
    DEBUG.printf("Connected, IPv6 link-local: %s\r\n", getIpv6LinkLocal().c_str());
  }

  // Debug: print DNS servers (v4 and v6) from active netif
  const char *netif_keys[] = {"WIFI_STA_DEF", "ETH_DEF"};
  for (int n = 0; n < 2; n++) {
    esp_netif_t *netif = esp_netif_get_handle_from_ifkey(netif_keys[n]);
    if (netif) {
      esp_netif_dns_info_t dns;
      for (int i = 0; i < 2; i++) {
        if (esp_netif_get_dns_info(netif, (esp_netif_dns_type_t)i, &dns) == ESP_OK) {
          if (dns.ip.type == ESP_IPADDR_TYPE_V4) {
            DEBUG.printf("DNS%d (%s IPv4): " IPSTR "\r\n", i, netif_keys[n], IP2STR(&dns.ip.u_addr.ip4));
          } else if (dns.ip.type == ESP_IPADDR_TYPE_V6) {
            DEBUG.printf("DNS%d (%s IPv6): %s\r\n", i, netif_keys[n], IPv6Address(dns.ip.u_addr.ip6.addr).toString().c_str());
          }
        }
      }
    }
  }

  // Debug: print mDNS-registered addresses on ETH interface
  esp_netif_t *eth_netif = esp_netif_get_handle_from_ifkey("ETH_DEF");
  if (eth_netif) {
    esp_ip6_addr_t ip6_ll, ip6_gl;
    if (esp_netif_get_ip6_linklocal(eth_netif, &ip6_ll) == ESP_OK) {
      DEBUG.printf("mDNS debug: ETH link-local: %s\r\n", IPv6Address(ip6_ll.addr).toString().c_str());
    }
    if (esp_netif_get_ip6_global(eth_netif, &ip6_gl) == ESP_OK) {
      DEBUG.printf("mDNS debug: ETH global: %s\r\n", IPv6Address(ip6_gl.addr).toString().c_str());
    }
  } else {
    DEBUG.printf("mDNS debug: ETH_DEF netif not found\r\n");
  }

