rnavarro/openevse_esp32_firmware/src/net_manager.cpp
    case ARDUINO_EVENT_WIFI_STA_STOP:
    {
      // Interface is going down completely — clear both global and link-local
      _ipv6address_global_wifi = "";
      _ipv6address_linklocal_wifi = "";
    } break;

    case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
    {
      auto& src = info.wifi_sta_disconnected;
      WiFiEventStationModeDisconnected dst;
      dst.ssid = String(reinterpret_cast<char*>(src.ssid));
      memcpy(dst.bssid, src.bssid, 6);
      dst.reason = static_cast<WiFiDisconnectReason>(src.reason);
      wifiOnStationModeDisconnected(dst);
    } break;

    case ARDUINO_EVENT_WIFI_STA_GOT_IP:
    {
      auto& src = info.got_ip.ip_info;
      WiFiEventStationModeGotIP dst;
      dst.ip = src.ip.addr;
      dst.mask = src.netmask.addr;
      dst.gw = src.gw.addr;
      wifiOnStationModeGotIP(dst);
      if (!_wifiIpv6Enabled) {
        // STA_CONNECTED enableIpV6 lost the netif-up race (cold boot).
        // Retry now: holding an IPv4 address proves the netif is up.
        _wifiIpv6Enabled = WiFi.enableIpV6();
        DEBUG.printf("WiFi enableIpV6 (GOT_IP retry): %s\r\n", _wifiIpv6Enabled ? "OK" : "FAILED");
      }
    } break;

    case ARDUINO_EVENT_WIFI_STA_GOT_IP6:
    {
      esp_ip6_addr_t addr = info.got_ip6.ip6_info.ip;
      handleGotIPv6(addr, "WIFI_STA_DEF", "WiFi");
    } break;

    case ARDUINO_EVENT_WIFI_AP_STACONNECTED:
    {
      auto& src = info.wifi_ap_staconnected;
      WiFiEventSoftAPModeStationConnected dst;
      memcpy(dst.mac, src.mac, 6);
      dst.aid = src.aid;
      wifiOnAPModeStationConnected(dst);
    } break;

    case ARDUINO_EVENT_WIFI_AP_STADISCONNECTED:
    {
      auto& src = info.wifi_ap_stadisconnected;
      WiFiEventSoftAPModeStationDisconnected dst;
      memcpy(dst.mac, src.mac, 6);
      dst.aid = src.aid;
      wifiOnAPModeStationDisconnected(dst);
    } break;

    case ARDUINO_EVENT_WIFI_SCAN_DONE:
    {
      for(WiFiScanCompleteCallback callback : _scanCompleteCallbacks) {
        callback(info.wifi_scan_done.number);
      }

      _scanCompleteCallbacks.clear();
      WiFi.scanDelete();
    } break;
#ifdef ENABLE_WIRED_ETHERNET
    case ARDUINO_EVENT_ETH_START:
      DBUGF("ETH Started, link %s", ETH.linkUp() ? "up" : "down");
      if(ETH.linkUp())
      {
        //set eth hostname here
        if(ETH.setHostname(esp_hostname.c_str())) {
          DBUGF("Set host name to %s", ETH.getHostname());
        } else {
          DBUGF("Setting host name failed: %s", esp_hostname.c_str());
        }
      } else {
        wifiStartInternal();
      }
      break;
    case ARDUINO_EVENT_ETH_CONNECTED:
      DBUGLN("ETH Connected");
      {
        // Request IPv6 on ETH interface (v2.x API, uppercase V); log failures
        bool ipv6_ok = ETH.enableIpV6();
        DEBUG.printf("ETH enableIpV6 (ETH_CONNECTED): %s\r\n", ipv6_ok ? "OK" : "FAILED");
      }
      break;
    case ARDUINO_EVENT_ETH_GOT_IP:
      DBUG("ETH MAC: ");
      DBUG(ETH.macAddress());
      DBUG(", IPv4: ");
      DBUG(ETH.localIP());
      if (ETH.fullDuplex()) {
        DBUG(", FULL_DUPLEX");
      }
      DBUG(", ");
      DBUG(ETH.linkSpeed());
      DBUGLN("Mbps");
      haveNetworkConnection(ETH.localIP());
      _macaddress = ETH.macAddress();
      _ethConnected = true;
      wifiStop();
      break;
    case ARDUINO_EVENT_ETH_GOT_IP6:
    {
      esp_ip6_addr_t addr = info.got_ip6.ip6_info.ip;
      handleGotIPv6(addr, "ETH_DEF", "ETH");
    } break;
    case ARDUINO_EVENT_ETH_DISCONNECTED:
      DBUGLN("ETH Disconnected");
      onGlobalIPv6Lost("ETH_DEF");
      _ethConnected = false;
      wifiStart();
      break;
    case ARDUINO_EVENT_ETH_STOP:
      DBUGLN("ETH Stopped");
      onGlobalIPv6Lost("ETH_DEF");
      _ipv6address_linklocal_eth = "";  // Interface going down — clear link-local too
      _ethConnected = false;
      break;
#endif
    default:
      break;
  }
}
#endif

void NetManagerTask::setup()
{
  DBUGLN("Starting Network Manager");

  // This is not really needed for our usecase on the ESP32, because random(n) uses theESP32 hardware random number
  // generator, but random() does not so safest to add some entropy here
  randomSeed(millis() | analogRead(RANDOM_SEED_CHANNEL));

  // If we have an SSID configured at this point we have likely
  // been running another firmware, clear the results
  if(isWifiClientConfigured()) {
    WiFi.persistent(true);
    WiFi.disconnect();
    ESPAL.eraseConfig();
  }

  // Stop the WiFi module
  WiFi.persistent(false);
  WiFi.mode(WIFI_OFF);

#ifdef ESP32
  WiFi.onEvent(onNetEventStatic);
#else
// TODO: Needs fixing if we ever support ESP8622
//  static auto _onStationModeConnected = WiFi.onStationModeConnected(net_wifi_onStationModeConnected);
//  static auto _onStationModeGotIP = WiFi.onStationModeGotIP(net_wifi_onStationModeGotIP);
//  static auto _onStationModeDisconnected = WiFi.onStationModeDisconnected(net_wifi_onStationModeDisconnected);
//  static auto _onSoftAPModeStationConnected = WiFi.onSoftAPModeStationConnected(net_wifi_onAPModeStationConnected);
//  static auto _onSoftAPModeStationDisconnected = WiFi.onSoftAPModeStationDisconnected(net_wifi_onAPModeStationDisconnected);
#endif

  // Initially startup the netwrok to kick things off
  manageState();

  if (MDNS.begin(esp_hostname.c_str()))
  {
    MDNS.addService("http", "tcp", 80);
    MDNS.addService("openevse", "tcp", 80);
    MDNS.addServiceTxt("openevse", "tcp", "type", buildenv.c_str());
    MDNS.addServiceTxt("openevse", "tcp", "version", currentfirmware.c_str());
    MDNS.addServiceTxt("openevse", "tcp", "id", ESPAL.getLongId());
    
  }
}

unsigned long NetManagerTask::handleMessage()
{
  MicroTasks::Message *msg;
  if(this->receive(msg))
  {
    switch (msg->id())
    {
      case NetMessage::WiFiRestart:
      case NetMessage::WiFiStop:
        wifiStopInternal();
        if(msg->id() == NetMessage::WiFiStop) { break; };

      case NetMessage::WiFiStart:
        wifiStartInternal();
        break;

      case NetMessage::WiFiAccessPointEnable:
        wifiStartAccessPoint();
        break;

      case NetMessage::WiFiAccessPointDisable:
        wifiStopAccessPoint();
        break;

      case NetMessage::NetworkEvent:
      {
        NetworkEventMessage *netEvent = static_cast<NetworkEventMessage *>(msg);
        onNetEvent(netEvent->event(), netEvent->info());
      }break;

      default:
        break;
    }

    delete msg;
  }

