rnavarro/openevse_esp32_firmware/src/net_manager.cpp
  return MicroTask.Infinate;
}

unsigned long NetManagerTask::serviceButton()
{
  int button = _led.getButtonPressed();

  //DBUGF("%lu %d %d", millis() - _wifiButtonTimeOut, button, _wifiButtonState);
  if(_wifiButtonState != button)
  {
    _wifiButtonState = button;
    if(WIFI_BUTTON_PRESSED_STATE == button) {
      DBUGF("Button pressed");
      _wifiButtonTimeOut = millis();
      _apMessage = false;
    } else {
      DBUGF("Button released");
      if(millis() > _wifiButtonTimeOut + WIFI_BUTTON_AP_TIMEOUT) {
        wifiStartAccessPoint();
      } else {
        displayState();
      }
    }
  }

  if(WIFI_BUTTON_PRESSED_STATE == _wifiButtonState && millis() > _wifiButtonTimeOut + WIFI_BUTTON_FACTORY_RESET_TIMEOUT)
  {
    DBUGLN("*** Factory Reset ***");

    _lcd.display(F("Factory Reset"), 0, 0, 0, LCD_CLEAR_LINE | LCD_DISPLAY_NOW);
    _lcd.display(F(""), 0, 1, 10 * 1000, LCD_CLEAR_LINE | LCD_DISPLAY_NOW);

    delay(1000);

    config_reset();
    ESPAL.eraseConfig();

    delay(50);
    ESPAL.reset();
  }
  else if(false == _apMessage && LOW == _wifiButtonState && millis() > _wifiButtonTimeOut + WIFI_BUTTON_AP_TIMEOUT)
  {
    DBUGLN("*** Enable Access Point ***");

    _lcd.display(F("Access Point"), 0, 0, 0, LCD_CLEAR_LINE | LCD_DISPLAY_NOW);
    _lcd.display(F(""), 0, 1, 10 * 1000, LCD_CLEAR_LINE | LCD_DISPLAY_NOW);
    _apMessage = true;
  }

  return 0;
}

unsigned long NetManagerTask::manageState()
{
  unsigned long delayTime = MicroTask.Infinate;

  switch (_state)
  {
    case NetState::Starting:
      #ifdef ENABLE_WIRED_ETHERNET
      wiredStart();
      #else
      wifiStartInternal();
      #endif
      break;
#ifdef ENABLE_WIRED_ETHERNET
    case NetState::WiredConnecting:
      if(millis() > _wiredTimeout) {
        DBUGF("Wired connection timed out");
        wifiStartInternal();
      } else {
        delayTime = _wiredTimeout - millis();
      }
      break;
#endif
    case NetState::StationClientConnecting:
      if(_clientDisconnects > WIFI_CLIENT_DISCONNECTS_BEFORE_AP) {
        wifiStartAccessPoint();
      }
      // Intentionally fall through to AP State for the same client reconnect logic
    case NetState::AccessPointConnecting:
      if(!isWifiClientConnected() && esid != 0 && esid != "" && millis() > _clientRetryTime) {
        if((WiFi.getStatusBits() & STA_CONNECTED_BIT) && _slaacGraceCount < 3) {
          // Associated at L2 but no usable address yet. On IPv6-only networks
          // SLAAC takes ~9-17s from WiFi.begin() — longer than the 10s retry —
          // so tearing down the association here guarantees the device never
          // completes address acquisition (observed live). Grant up to 3 grace
          // periods (~30s associated) before forcing a re-association.
          _slaacGraceCount++;
          _clientRetryTime = millis() + WIFI_CLIENT_RETRY_TIMEOUT;
          DEBUG.printf("WiFi associated, no address yet — SLAAC grace %d/3\r\n",
                       _slaacGraceCount);
          if (!_wifiIpv6Enabled) {
            // enableIpV6 lost the netif-up race at STA_CONNECTED — without it
            // no SLAAC can happen, so the grace would be wasted waiting for an
            // address that can never arrive. The netif is certainly up by now
            // (we have been associated for >= one retry period): retry here
            // instead of burning all 3 graces and re-associating (observed to
            // cost ~75s of race roulette on a v6-only network).
            _wifiIpv6Enabled = WiFi.enableIpV6();
            DEBUG.printf("WiFi enableIpV6 (grace retry): %s\r\n",
                         _wifiIpv6Enabled ? "OK" : "FAILED");
          }
        } else {
          _slaacGraceCount = 0;
          wifiClientConnect();
        }
      }

      delayTime = _clientRetryTime - millis();
      break;
    case NetState::StationClientReconnecting:
      break;
    case NetState::Connected:
      if(millis() > _apAutoApStopTime)
      {
        if(isWifiModeAp()) {
          wifiStopAccessPoint();
        }
      } else {
        delayTime = _apAutoApStopTime - millis();
      }
      break;
  }

  return delayTime;
}

unsigned long NetManagerTask::loop(MicroTasks::WakeReason reason)
{
  unsigned long nextLoopDelay = MicroTask.Infinate;

  Profile_Start(NetManagerTask::loop);

//  DBUG("NetManagerTask woke: ");
//  DBUG(NetState::Starting == _state ? "Starting" :
//       NetState::WiredConnecting == _state ? "WiredConnecting" :
//       NetState::AccessPointConnecting == _state ? "AccessPointConnecting" :
//       NetState::StationClientConnecting == _state ? "StationClientConnecting" :
//       NetState::StationClientReconnecting == _state ? "StationClientReconnecting" :
//       NetState::Connected == _state ? "Connected" :
//       "UNKNOWN");
//  DBUG(", ");
//  DBUGLN(WakeReason_Scheduled == reason ? "WakeReason_Scheduled" :
//         WakeReason_Event == reason ? "WakeReason_Event" :
//         WakeReason_Message == reason ? "WakeReason_Message" :
//         WakeReason_Manual == reason ? "WakeReason_Manual" :
//         "UNKNOWN");

  if(WakeReason_Message == reason) {
    nextLoopDelay = min(handleMessage(), nextLoopDelay);
  }

  nextLoopDelay = min(serviceButton(), nextLoopDelay);

  nextLoopDelay = min(manageState(), nextLoopDelay);

  if(_dnsServerStarted) {
    _dnsServer.processNextRequest(); // Captive portal DNS re-dierct
  }

  Profile_End(NetManagerTask::loop, 5);

  return nextLoopDelay;
}

#ifdef ENABLE_WIRED_ETHERNET
void NetManagerTask::wiredStart()
{
  DBUGLN("Starting wired connection");
  //ETH.setHostname(esp_hostname.c_str());
  // https://github.com/espressif/arduino-esp32/pull/6188/files
  pinMode(ETH_PHY_POWER, OUTPUT);
#ifdef RESET_ETH_PHY_ON_BOOT
  digitalWrite(ETH_PHY_POWER, LOW);
  delay(350);
#endif // #ifdef RESET_ETH_PHY_ON_BOOT
  digitalWrite(ETH_PHY_POWER, HIGH);
  ETH.begin();

  _state = NetState::WiredConnecting;
  _wiredTimeout = millis() + WIRED_CONNECT_TIMEOUT;
}
#endif

void NetManagerTask::wifiStartInternal()
{
  _clientDisconnects = 0;

  // 1) If no network configured start up access point
  if (esid == 0 || esid == "")
  {
    wifiStartAccessPoint();
  }
  // 2) else try and connect to the configured network
  else
  {
    wifiStartClient();
  }
}

void NetManagerTask::wifiStopInternal()
{
  wifiTurnOffAp();
  if (isWifiModeSta()) {
    WiFi.disconnect(true);
  }
}

