rnavarro/openevse_esp32_firmware/src/net_manager.cpp
void NetManagerTask::wifiStart()
{
  DBUGF("NetManagerTask::wifiStart %d", WiFi.getMode());
  send(new NetMessage(NetMessage::WiFiStart));
}

void NetManagerTask::wifiStop()
{
  DBUGF("NetManagerTask::wifiStop %d", WiFi.getMode());
  send(new NetMessage(NetMessage::WiFiStop));
}

void NetManagerTask::wifiRestart()
{
  DBUGF("NetManagerTask::wifiRestart %d", WiFi.getMode());
  send(new NetMessage(NetMessage::WiFiRestart));
}

void NetManagerTask::wifiTurnOffAp()
{
  DBUGF("NetManagerTask::wifiTurnOffAp %d", WiFi.getMode());
  if(isWifiModeAp()) {
    send(new NetMessage(NetMessage::WiFiAccessPointDisable));
  }
}

void NetManagerTask::wifiTurnOnAp()
{
  DBUGF("NetManagerTask::wifiTurnOnAp %d", WiFi.getMode());
  if(!isWifiModeAp()) {
    send(new NetMessage(NetMessage::WiFiAccessPointEnable));
  }
}

bool NetManagerTask::isConnected()
{
  return isWifiClientConnected() || isWiredConnected();
}

bool NetManagerTask::isWifiClientConnected()
{
  // WiFi.isConnected() is status()==WL_CONNECTED, which the Arduino core sets
  // ONLY on IPv4 GOT_IP (WiFiGeneric.cpp:1105) — GOT_IP6 sets status bits but
  // never WL_CONNECTED. On an IPv6-only network (no DHCPv4) that gate stays
  // false forever, so also accept a routable IPv6 global address as connected.
  // _ipv6address_global_wifi is cleared on STA disconnect (onGlobalIPv6Lost),
  // so a non-empty value implies a live association.
  return (WiFi.isConnected() || _ipv6address_global_wifi.length() > 0)
         && isWifiModeSta();
}

bool NetManagerTask::isWiredConnected()
{
#ifdef ENABLE_WIRED_ETHERNET
  return _ethConnected;
#else
  return false;
#endif
}